app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("updated_at", "body", "post_id", "created_at") VALUES('2009-11-28 16:40:15', 'agreed!', 1, '2009-11-28 16:40:15')