app/controllers/posts_controller.rb

INSERT INTO "posts" ("updated_at", "title", "body", "created_at") VALUES('2009-11-28 15:02:59', 'rails rocks', 'Hi,rails!', '2009-11-28 15:02:59')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Hi,rails!and even update!', "updated_at" = '2009-11-28 15:03:12' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])